Tekla Open API Reference for Tekla Structures 2025
PrintAttributes.PrinterInstance Property
 The name of the printer instance. Can be fetched from the printer catalog.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string PrinterInstance { get; set; }
Public Property PrinterInstance As String
	Get
	Set
Property Value
Type: String
See Also
Reference
PrintAttributes Class
Tekla.Structures.Drawing Namespace